# Homework - SQL Programming

1. Use Google Colabortory and do your homework.
3. (In Google colaboratory) Before you submit your homework, restart kernel and run every cell!
4. Save (File->Save) the file
5. Submit your homework (this file) in Google classroom
6. **Don't forget to click "제출" button** ("Submit", "완료로 표시", 또는 "제출" 버턴을 누르지 않으면 제출된 것이 아님)
7. No late homeworks will be accepted for any reason!

To edit this cell, double click here
```
이름:배준성
학번:20150487
학과:전자공학과
제출일:2020.12.11
```

In [ ]:
%load_ext sql

In [ ]:
!pip install pymysql

Collecting pymysql
  Downloading https://files.pythonhosted.org/packages/1a/ea/dd9c81e2d85efd03cfbf808736dd055bd9ea1a78aea9968888b1055c3263/PyMySQL-0.10.1-py2.py3-none-any.whl (47kB)
     |████████████████████████████████| 51kB 2.7MB/s
Installing collected packages: pymysql
Successfully installed pymysql-0.10.1

### Use your host, id, password, and database

In [ ]:
import getpass
user = 'admin'
password = getpass.getpass()
host='bjsdb.cxfjkzcwihvs.us-east-1.rds.amazonaws.com'
database = 'companydb'
connection_string = f'mysql+pymysql://{user}:{password}@{host}:3306/{database}'
    
%sql $connection_string

··········

'Connected: admin@companydb'

### Reset CompanyDB

In [ ]:
%%sql
#init DB
SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0;
SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0;

DROP DATABASE IF EXISTS companydb;
CREATE DATABASE IF NOT EXISTS companydb;
USE companydb;

DROP TABLE IF EXISTS DEPENDENT;
DROP TABLE IF EXISTS WORKS_ON;
DROP TABLE IF EXISTS PROJECT;
DROP TABLE IF EXISTS DEPT_LOCATIONS;
DROP TABLE IF EXISTS DEPARTMENT;
DROP TABLE IF EXISTS EMPLOYEE;

CREATE TABLE EMPLOYEE
(       Fname VARCHAR(15) NOT NULL,
        Minit CHAR,
        Lname VARCHAR(15) NOT NULL,
        Ssn CHAR(9) NOT NULL,
        Bdate DATE,
        Address VARCHAR(30),
        Sex CHAR,
        Salary DECIMAL(10, 2),
        Superssn CHAR(9),
        Dno INT,
        PRIMARY KEY (Ssn),
        FOREIGN KEY (Superssn) 
                REFERENCES EMPLOYEE(Ssn) 
                ON DELETE SET NULL
                ON UPDATE CASCADE,
        FOREIGN KEY (Dno) 
                REFERENCES DEPARTMENT(Dnumber)
                ON DELETE SET NULL
                ON UPDATE CASCADE
) ENGINE=InnoDB;


CREATE TABLE DEPARTMENT
(       Dname VARCHAR(15) NOT NULL,
        Dnumber INT NOT NULL,
        Mgrssn CHAR(9),
        Mgrstartdate DATE,
        PRIMARY KEY (Dnumber),
        UNIQUE (Dname),
        FOREIGN KEY (Mgrssn) 
                REFERENCES EMPLOYEE(Ssn)
                ON DELETE SET NULL
                ON UPDATE CASCADE
) ENGINE=InnoDB;


CREATE TABLE DEPT_LOCATIONS
(       Dnumber INT NOT NULL,
        Dlocation VARCHAR(15) NOT NULL,
        PRIMARY KEY (Dnumber, Dlocation),
        FOREIGN KEY (Dnumber)
                REFERENCES DEPARTMENT(Dnumber) 
                ON DELETE CASCADE
                ON UPDATE CASCADE
) ENGINE=InnoDB;


CREATE TABLE PROJECT
(       Pname VARCHAR(15) NOT NULL,
        Pnumber INT NOT NULL,
        Plocation VARCHAR(15),
        Dnum INT,
        PRIMARY KEY (Pnumber),
        UNIQUE (Pname),
        FOREIGN KEY (Dnum) 
                REFERENCES DEPARTMENT(Dnumber)
                ON DELETE SET NULL
                ON UPDATE CASCADE
) ENGINE=InnoDB;


CREATE TABLE WORKS_ON
(       Essn CHAR(9) NOT NULL,
        Pno INT NOT NULL,
        Hours DECIMAL(3, 1) ,
        PRIMARY KEY (Essn, Pno),
        FOREIGN KEY (Essn) 
                REFERENCES EMPLOYEE(Ssn)
                ON DELETE CASCADE
                ON UPDATE CASCADE,
        FOREIGN KEY (Pno) 
                REFERENCES PROJECT(Pnumber)
                ON DELETE CASCADE
                ON UPDATE CASCADE
) ENGINE=InnoDB;


CREATE TABLE DEPENDENT
(       Essn CHAR(9) NOT NULL,
        Dependent_name VARCHAR(15) NOT NULL,
        Sex CHAR,
        Bdate DATE,
        Relationship VARCHAR(8),
        PRIMARY KEY (Essn, Dependent_name),
        FOREIGN KEY (Essn) 
                REFERENCES EMPLOYEE(Ssn)
                ON DELETE CASCADE
                ON UPDATE CASCADE
) ENGINE=InnoDB;


insert into EMPLOYEE values
        ("John", "B", "Smith", "123456789","1965-01-09", "731-Fondren-Houston-TX", "M", 30000, "333445555", 5),
        ("Franklin", "T", "Wong", "333445555","1955-12-08", "638-Voss-Houston-TX", "M", 40000, "888665555", 5),
        ("Alicia", "J", "Zelaya", "999887777", "1968-01-19", "3321-Castle-Spring-TX", "F", 25000, "987654321", 4),
        ("Jennifer", "S", "Wallace", "987654321", "1941-06-20", "291-Berry-Bellaire-TX", "F", 43000, "888665555", 4),
        ("Ramesh", "K", "Narayan", "666884444", "1962-09-15", "975-Fire-Oak-Humble-TX", "M", 38000, "333445555", 5),
        ("Joyce", "A", "English", "453453453", "1972-07-31", "5631-Rice-Houston-TX", "F", 25000, "333445555", 5),
        ("Ahmad", "V", "Jabbar", "987987987", "1969-03-29", "980-Dallas-Houston-TX", "M", 25000, "987654321", 4),
        ("James", "E", "Borg", "888665555", "1937-11-10", "450-Stone-Houston-TX", "M", 55000, NULL, 1);


insert into DEPENDENT  values 
        (333445555, "Alice", "F","1986-04-05", "Daughter"),
        (333445555, "Theodore", "M","1983-10-25", "Son"),
        (333445555, "Joy", "F","1958-05-03", "Spouse"),
        (987654321, "Abner", "M","1942-02-28", "Spouse"),
        (123456789, "Michael", "M","1988-01-04", "Son"),
        (123456789, "Alice", "F", "1988-12-30", "Daughter"),
        (123456789, "Elizabeth", "F", "1967-05-05", "Spouse");


insert into DEPARTMENT values 
        ("Research", 5, 333445555,"1988-05-22"),
        ("Administration", 4, 987654321,"1995-01-01"),
        ("Headquarters", 1, 888665555,"1981-06-19");

insert into DEPT_LOCATIONS values 
        (1, "Houston"),
        (4, "Stafford"),
        (5, "Bellaire"),
        (5, "Sugarland"),
        (5, "Houston");


insert into PROJECT values 
        ("ProductX", 1, "Bellaire", 5),
        ("ProductY", 2, "Sugarland", 5),
        ("ProductZ", 3, "Houston", 5),
        ("Computerization", 10, "Stafford", 4),
        ("Reorganization", 20, "Houston", 1),
        ("Newbenefits", 30, "Stafford", 4);


insert into WORKS_ON values
        (123456789, 1, 32.5),
        (123456789, 2, 7.5),
        (666884444, 3, 40.0),
        (453453453, 1, 20.0),
        (453453453, 2, 20.0),
        (333445555, 2, 10.0),
        (333445555, 3, 10.0),
        (333445555, 10, 10.0),
        (333445555, 20, 10.0),
        (999887777, 30, 30.0),
        (999887777, 10, 10.0),
        (987987987, 10, 35.0),
        (987987987, 30, 5.0),
        (987654321, 30, 20.0),
        (987654321, 20, 15.0),
        (888665555, 20, NULL); 

SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS;
SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS;

 * mysql+pymysql://admin:***@bjsdb.cxfjkzcwihvs.us-east-1.rds.amazonaws.com:3306/companydb
0 rows affected.
0 rows affected.
6 rows affected.
1 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
8 rows affected.
7 rows affected.
3 rows affected.
5 rows affected.
6 rows affected.
16 rows affected.
0 rows affected.
0 rows affected.

[]

### Check EMPLOYEE

In [ ]:
%%sql
select *
from EMPLOYEE

 * mysql+pymysql://admin:***@bjsdb.cxfjkzcwihvs.us-east-1.rds.amazonaws.com:3306/companydb
8 rows affected.

[('John', 'B', 'Smith', '123456789', datetime.date(1965, 1, 9), '731-Fondren-Houston-TX', 'M', Decimal('30000.00'), '333445555', 5),
 ('Franklin', 'T', 'Wong', '333445555', datetime.date(1955, 12, 8), '638-Voss-Houston-TX', 'M', Decimal('40000.00'), '888665555', 5),
 ('Joyce', 'A', 'English', '453453453', datetime.date(1972, 7, 31), '5631-Rice-Houston-TX', 'F', Decimal('25000.00'), '333445555', 5),
 ('Ramesh', 'K', 'Narayan', '666884444', datetime.date(1962, 9, 15), '975-Fire-Oak-Humble-TX', 'M', Decimal('38000.00'), '333445555', 5),
 ('James', 'E', 'Borg', '888665555', datetime.date(1937, 11, 10), '450-Stone-Houston-TX', 'M', Decimal('55000.00'), None, 1),
 ('Jennifer', 'S', 'Wallace', '987654321', datetime.date(1941, 6, 20), '291-Berry-Bellaire-TX', 'F', Decimal('43000.00'), '888665555', 4),
 ('Ahmad', 'V', 'Jabbar', '987987987', datetime.date(1969, 3, 29), '980-Dallas-Houston-TX', 'M', Decimal('25000.00'), '987654321', 4),
 ('Alicia', 'J', 'Zelaya', '999887777', datetime.date(1968, 1, 19), '3321-Castle-Spring-TX', 'F', Decimal('25000.00'), '987654321', 4)]

## Warning: Your companydb state MUST be clean as initial state

- Refer to jupyter notebook on "SQL Lab on AWS RDS"

### 1. ssn이 '888665555'인 직원과 그 모든 직간접 부하직원의 이름과 '888665555'로 부터 부하직원에 이르는 경로를 출력한다. (companydb DB 사용, mysql recursive CTE 참조, Googling) (20점) 20점

```
+---------------------+--------------------------------------------------------+
| ename               | path                                                   |
+---------------------+--------------------------------------------------------+
| James E. Borg       | James E. Borg                                          |
| Franklin T. Wong    | James E. Borg > Franklin T. Wong                       |
| John B. Smith       | James E. Borg > Franklin T. Wong > John B. Smith       |
| Joyce A. English    | James E. Borg > Franklin T. Wong > Joyce A. English    |
| Ramesh K. Narayan   | James E. Borg > Franklin T. Wong > Ramesh K. Narayan   |
| Jennifer S. Wallace | James E. Borg > Jennifer S. Wallace                    |
| Ahmad V. Jabbar     | James E. Borg > Jennifer S. Wallace > Ahmad V. Jabbar  |
| Alicia J. Zelaya    | James E. Borg > Jennifer S. Wallace > Alicia J. Zelaya |
+---------------------+--------------------------------------------------------+
```

In [ ]:
%%sql
WITH recursive CTE AS (
    SELECT ssn, superssn, concat(fname," ",minit,". ",lname) as ename, cast(ssn as char(255)) as sort, cast(concat(fname," ",minit,". ",lname) as char(255)) as path
    FROM EMPLOYEE 
	  WHERE ssn = '888665555' 
	  UNION ALL 
	  SELECT B.ssn, B.superssn, concat(B.fname," ",B.minit,". ",B.lname) as name,
    cast(concat(C.sort, " > ",B.ssn)as char(255)) as sort,
    cast(concat(C.path, " > ",B.fname," ",B.minit,". ",B.lname)as char(255)) as path
	  FROM EMPLOYEE B, CTE C 
	  WHERE B.superssn = C.ssn 
  ) 

 SELECT ename, path
 FROM CTE
 order by sort;

 * mysql+pymysql://admin:***@bjsdb.cxfjkzcwihvs.us-east-1.rds.amazonaws.com:3306/companydb
8 rows affected.

[('James E. Borg', 'James E. Borg'),
 ('Franklin T. Wong', 'James E. Borg > Franklin T. Wong'),
 ('John B. Smith', 'James E. Borg > Franklin T. Wong > John B. Smith'),
 ('Joyce A. English', 'James E. Borg > Franklin T. Wong > Joyce A. English'),
 ('Ramesh K. Narayan', 'James E. Borg > Franklin T. Wong > Ramesh K. Narayan'),
 ('Jennifer S. Wallace', 'James E. Borg > Jennifer S. Wallace'),
 ('Ahmad V. Jabbar', 'James E. Borg > Jennifer S. Wallace > Ahmad V. Jabbar'),
 ('Alicia J. Zelaya', 'James E. Borg > Jennifer S. Wallace > Alicia J. Zelaya')]

### 2. 입력으로 주어진 ssn의 모든 직간접 부하직원을 찾으려 한다. 이를 수행하는 Java JDBC 코드를 작성한다. (60점) 0점

**방법**: Common table supervisees에 해당하는  temporary table 'tempssn' (using MEMORY engine)을 사용한다. tempssn에 루프의 전 단계에서 삽입된 ssn과 EMPLOYEE 테이블을 조인하여 다음 단계의 부하직원을 찾는다. 다음 단계의 직원이 한 명도 없다면 루프를 끝낸다. (**반드시 이 방법을 사용하여여 한다.**)

- temporary table (using memory engine)를 사용하지 않으면 0점
- insert into ... select ...를 사용하면 0점
- code의 indentation이 맞지 않으면 0점
- recursion을 사용하면 0점
- truncate를 사용하면 0점

테스트하기전에 반드시 아래 데이터를 삽입한다. 

```SQL
insert into EMPLOYEE(fname, lname, ssn, superssn) values
    ('UUU', 'UUU', '000000001', '999887777'),
    ('VVV', 'VVV', '000000002', '000000001'),
    ('WWW', 'WWW', '000000003', '000000002'),
    ('XXX', 'XXX', '000000004', '000000003'),
    ('YYY', 'YYY', '000000005', '000000004'),
    ('ZZZ', 'ZZZ', '000000006', '000000005')
```

In [ ]:
%%sql
insert into EMPLOYEE(fname, lname, ssn, superssn) values
    ('UUU', 'UUU', '000000001', '999887777'),
    ('VVV', 'VVV', '000000002', '000000001'),
    ('WWW', 'WWW', '000000003', '000000002'),
    ('XXX', 'XXX', '000000004', '000000003'),
    ('YYY', 'YYY', '000000005', '000000004'),
    ('ZZZ', 'ZZZ', '000000006', '000000005')

 * mysql+pymysql://admin:***@bjsdb.cxfjkzcwihvs.us-east-1.rds.amazonaws.com:3306/companydb
6 rows affected.

[]

**제출문**:
1. 자바 코드
2. 아래의 각 테스트 케이스에 해당하는 이클립스 스크린샷. 

**CHEATING 발견시 모든 제출자의 점수를 "-만점"으로 처리함. (예 20점 만점이면 -20점)**

## Your Java Code
- To edit this cell, double click here

```java
//copy&paste your java code here
import java.sql.*;
import javax.swing.JOptionPane;
import javax.swing.JPasswordField;
import java.io.*;


public class DBTest 
{
	public static void main (String args[])
	{
		try
		{
			Class.forName ("com.mysql.cj.jdbc.Driver");
			String host = "bjsdb.cxfjkzcwihvs.us-east-1.rds.amazonaws.com:3306/";
			String db= "companydb";
			String user = "admin";
			String password = getPassword();
			Connection con = DriverManager.getConnection("jdbc:mysql://" + host + db + "?useSSL=false", user, password);
//###################################################
			Statement stmt = con.createStatement();
			stmt.executeUpdate("create temporary table tempssn(ssn int primary key, superssn int) engine = MEMORY");
			

			String query = "select  a.ssn as lv0ssn, b.ssn as lv1ssn\r\n"
					+ "from EMPLOYEE a \r\n"
					+ "inner join EMPLOYEE b\r\n"
					+ "on a.ssn = b.superssn and a.ssn = ?";
//			String updatetemp = "";
			
			PreparedStatement pstmt = con.prepareStatement(query);
			String ssn = readEntry("Enter a ssn: ");
			pstmt.clearParameters();
			pstmt.setString(1,ssn);
			ResultSet rset = pstmt.executeQuery();
			
			while (rset.next ()) {
				String lv0ssn =  rset.getString(1);
				String lv1ssn =  rset.getString(2);
				System.out.println(lv0ssn + ", " + lv1ssn);
			}
			

			
			rset.close();
			pstmt.close();
			stmt.close();
			con.close();
//####################################################
		}
		catch (SQLException ex)
		{
			System.out.println("SQLException" + ex);
		}
		catch (Exception ex)
		{
			System.out.println("Exception:" + ex);
		}
	}
	private static String getPassword() 
	{
		final String password, message = "Enter password";
		if(System.console() == null)
		{
			final JPasswordField pf = new JPasswordField();
			password = JOptionPane.showConfirmDialog(null, pf, message,
					JOptionPane.OK_CANCEL_OPTION,
					JOptionPane.QUESTION_MESSAGE ) == JOptionPane.OK_OPTION ?
							new String(pf.getPassword()) : "";
		}
		else
			password = new String(System.console().readPassword("%s> ", message));
		return password;
	}

	// ReadEntry function -- to read input string
	private static String readEntry(String prompt)
	{
		try 
		{
			StringBuffer buffer = new StringBuffer();
			System.out.print(prompt);
			System.out.flush();
			int c = System.in.read();
			while (c != '\n' && c != -1) {
				buffer.append((char)c);
				c = System.in.read();
			}
			return buffer.toString().trim();
		}
		
		catch (IOException e) 
		{
			return "";
		}
	}

}

```

## Test Case SELF-CHECK

- 아래 CELL을 수정하여 성공한 경우,
#### Test Case 1: SUCCESS

- 실패한 경우,
#### Test Case 1: FAIL
로 표시한다.
- 다른 Testcase에 대해서도 같은 방식으로 표기한다.

## Test Case 1: SUCCESS or FAIL
```
Enter a ssn: 888665555
333445555 at level 1
987654321 at level 1
123456789 at level 2
453453453 at level 2
666884444 at level 2
987987987 at level 2
999887777 at level 2
000000001 at level 3
000000002 at level 4
000000003 at level 5
000000004 at level 6
000000005 at level 7
000000006 at level 8
END OF LIST
```

- To edit this cell, double click here
- copy&paste your eclipse screenshot here

## Test Case 2: SUCCESS or FAIL
```
Enter a ssn: 453453453
END OF LIST

```

- To edit this cell, double click here
- copy&paste your eclipse screenshot here

## Test Case 3: SUCCESS or FAIL
```
Enter a ssn: 999887777
000000001 at level 1
000000002 at level 2
000000003 at level 3
000000004 at level 4
000000005 at level 5
000000006 at level 6
END OF LIST
```

- To edit this cell, double click here
- copy&paste your eclipse screenshot here

## Test Case 4: SUCCESS or FAIL
```
Enter a ssn: 333445555
123456789 at level 1
453453453 at level 1
666884444 at level 1
END OF LIST
```

- To edit this cell, double click here
- copy&paste your eclipse screenshot here